Autodesk.Revit.ApplicationServices.ControlledApplication.GetAdpSessionId
Get session_id that is used by Revit to report analytics (ADP) events
Remarks:
This method is intended for inhouse addins that do their own ADP initizalization
rather than using sendAdpData() method. Adding session_id as an attribute to the addin
ADP events allows to correlate these events with Revit internal events from the same session
during the analysis.
session_id does not change during the session, it is enough to query it once during ADP initialization
in the addin
Returns:
session_id that is reported by all Revit ADP events
Since:
2022